In [1]:
import matplotlib.pyplot as plt  
%matplotlib inline
import pandas as pd
import os
import sqlite3

os.getcwd()
# os.chdir('/')

'/Users/esteban.storch'

In [23]:
database = sqlite3.connect("petstore.db")

In [24]:
# Show all tables
df = pd.read_sql_query('SELECT name FROM sqlite_master WHERE type="table";', database)
df

                name
0               pets
1             owners
2  procedure_history
3  procedure_details

In [26]:
# Get all distinct pet kinds
df = pd.read_sql_query('SELECT DISTINCT kind FROM pets;', database)
df.head()

  current_date current_time    current_timestamp
0   2018-04-04     07:45:24  2018-04-04 07:45:24

In [45]:
# Get all distinct procedure types
df = pd.read_sql_query('SELECT DISTINCT `type FROM procedure_details;', database)
df.head()

        id        name kind  gender  age  owner_id
0  J6-8562     Blackie  Dog    male   11      5168
1  P2-7342     Cuddles  Dog    male   13      4378
2  J2-3320  Heisenberg  Dog    male    3      1319
3  U4-9376       Scout  Dog  female    2      7846
4  H8-1429        Lily  Dog  female    3      7846

In [42]:
# Count pets
df = pd.read_sql_query('SELECT COUNT(*) FROM pets;', database)
df.head()

     kind
0     Cat
1     Dog
2  Parrot

In [43]:
# Get the 5 oldest pets
df = pd.read_sql_query('SELECT * FROM pets ORDER BY age ASC LIMIT 5;', database)
df.head()

   COUNT(DISTINCT kind)
0                     3

In [2]:
# Get the 1 most expensive procedure
df = pd.read_sql_query('SELECT * FROM procedure_details ORDER BY price DESC LIMIT 1;', database)
df.head()

NameError: name 'database' is not defined